### Index Functionalities
1. Reindexing
2. Dropping
3. Allignment

In [2]:
import pandas as pd
import numpy as np

Reindexing

In [9]:
s = pd.Series([1, 3, 5, 7, 9], index=['one', 'two', 'three', 'four', 'five'])
s

one      1
two      3
three    5
four     7
five     9
dtype: int64

In [11]:
s.reindex(['three', 'one', 'five', 'six'])

three    5.0
one      1.0
five     9.0
six      NaN
dtype: float64

In [12]:
s2 = pd.Series([1, 5, 6, 3], index = [0, 3, 5, 6])
s2

0    1
3    5
5    6
6    3
dtype: int64

In [13]:
s2.reindex(range(6), method = 'ffill')

0    1
1    1
2    1
3    5
4    5
5    6
dtype: int64

In [14]:
s2.reindex(range(6), method = 'bfill')

0    1
1    5
2    5
3    5
4    6
5    6
dtype: int64

Dropping

In [15]:
s3 = pd.Series(np.arange(4), index = ['red', 'blue', 'yellow', 'green'])
s3

red       0
blue      1
yellow    2
green     3
dtype: int64

In [16]:
s3.drop('red')

blue      1
yellow    2
green     3
dtype: int64

In [17]:
s3.drop(['blue', 'yellow'])

red      0
green    3
dtype: int64

In [18]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                     index = ['red', 'blue', 'yellow', 'green'],
                    columns = ['ball', 'pen', 'pillow', 'mug'])

In [19]:
frame

        ball  pen  pillow  mug
red        0    1       2    3
blue       4    5       6    7
yellow     8    9      10   11
green     12   13      14   15

In [20]:
frame.drop('red')

        ball  pen  pillow  mug
blue       4    5       6    7
yellow     8    9      10   11
green     12   13      14   15

In [21]:
frame.drop(['red', 'blue'])

        ball  pen  pillow  mug
yellow     8    9      10   11
green     12   13      14   15

In [22]:
frame.drop('ball', axis = 1)

        pen  pillow  mug
red       1       2    3
blue      5       6    7
yellow    9      10   11
green    13      14   15

In [24]:
frame.drop(['ball', 'pen'], axis = 1)

        pillow  mug
red          2    3
blue         6    7
yellow      10   11
green       14   15

In [25]:
s4 = pd.Series([2,4,7,9], index = ['white', 'yellow', 'green', 'blue'])
s5 = pd.Series([3,5,1,5,8], index = ['blue', 'black', 'pink', 'white', 'violet'])

In [26]:
s4 + s5

black      NaN
blue      12.0
green      NaN
pink       NaN
violet     NaN
white      7.0
yellow     NaN
dtype: float64

In [27]:
frame1 = pd.DataFrame(np.arange(16).reshape(4,4),
                     index = ['red', 'blue', 'yellow', 'green'],
                     columns = ['pen', 'mug', 'cup', 'pillow'])
frame2 = pd.DataFrame(np.arange(12).reshape(3,4),
                     index = ['red', 'blue', 'white'],
                     columns = ['mug', 'glass', 'wallet', 'pillow'])

In [28]:
frame1 + frame2

        cup  glass  mug  pen  pillow  wallet
blue    NaN    NaN  9.0  NaN    14.0     NaN
green   NaN    NaN  NaN  NaN     NaN     NaN
red     NaN    NaN  1.0  NaN     6.0     NaN
white   NaN    NaN  NaN  NaN     NaN     NaN
yellow  NaN    NaN  NaN  NaN     NaN     NaN

In [40]:
ser1 = pd.Series(np.arange(4), index = ['pen', 'mug', 'cup', 'pillow'])

In [41]:
frame1 - ser1

        pen  mug  cup  pillow
red       0    0    0       0
blue      4    4    4       4
yellow    8    8    8       8
green    12   12   12      12

In [42]:
ser1['blanket'] = 9

In [43]:
frame1 - ser1

        blanket  cup  mug  pen  pillow
red         NaN    0    0    0       0
blue        NaN    4    4    4       4
yellow      NaN    8    8    8       8
green       NaN   12   12   12      12

In [47]:
frame

        ball  pen  pillow  mug
red        0    1       2    3
blue       4    5       6    7
yellow     8    9      10   11
green     12   13      14   15

In [44]:
def f(x):
    return x.max()-x.min()
frame.apply(f)

ball      12
pen       12
pillow    12
mug       12
dtype: int64

In [45]:
frame.apply(f, axis = 1)

red       3
blue      3
yellow    3
green     3
dtype: int64

In [46]:
frame.sum()

ball      24
pen       28
pillow    32
mug       36
dtype: int64

In [48]:
frame.mean()

ball      6.0
pen       7.0
pillow    8.0
mug       9.0
dtype: float64

In [49]:
frame.describe()

            ball        pen     pillow        mug
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000